import React from "react";
import TimelineCard from "../timeline/TimeLineCard";
import CardContent from "../timeline/CardContent";
import CardLine from "../timeline/CardLine";

const Timeline = () => {
  return (
    <div className="flex flex-col items-center p-12 gap-2 z-30">
      <TimelineCard time="29 AUG 2024">
        <CardContent
          main="เทคนิคการเป็นดีเจ และพอดแคสต์: DJ & Podcast Skills คณะนิเทศศาสตร์ "
          sub="ใครที่ชอบการพูดเป็นชีวิตจิตใจ เล่าอะไรใครก็ฟัง อยากจัดรายการเป็นของตัวเอง ต้องมาลองที่ Workshop นี้ Pro-DJ จาก บริษัท Mellow Pop เครือ MCOT จะพาน้องๆ ได้เรียนรู้การจัดรายการ Podcast ได้รู้หัวใจสำคัญของการเป็น DJ มืออาชีพ"
        />
        <CardContent
          main="การแข่งขันการแปลบทซีรีส์ เรื่อง 23.5 องศาที่โลกเอียง (ไทย-อังกฤษ)"
          sub="แข่งขันการแปลบทซีรีส์ จากภาษาไทยเป็นภาษาอังกฤษ ด้วยโจทย์ซีรีส์ จริง เตรียมตัวให้พร้อมเตรียมใจให้ลุกโชนเพื่อพร้อมสำหรับการแข่งขันโดยผู้เข้าแข่งขันจะต้องมาลงทะเบียนหน้าห้องแข่งขันก่อน"
        />
        <CardContent
          main="BU International X British Council - Impromptu Speech Competition"
          sub="This exciting competition on August 30, 2024, will also feature an impromptu speech competition, introducing participants to the foundational principles of delivering effective impromptu speeches."
        />
      </TimelineCard>
      <CardLine />
      <TimelineCard time="30 AUG 2024">
        <CardContent
          main="AI-Generated Biz Eng Story Workshop"
          sub="Experience our exciting workshops designed to improve your AI-assisted English for communication skills. In our Prompt Canvas with AI Tools workshop, you will create a prompt canvas to facilitate you as users of AI tools such as ChatGPT and Gemini. "
        />
        <CardContent
          main="Step into Your Future with BBA International x Alibaba Cloud Certificate
          หลักสูตรนานาชาติ | Business Administration"
          sub="Explore our specialized tracks:
          📈 Track 1: Digital Marketing
          📊 Track 2: Data Science for Business
          🌍 Track 3: International Business Management
          💰 Track 4: Finance and Investment"
        />
        <CardContent
          main="การจัดวางองค์ประกอบด้านการออกแบบนิเทศศิลป์
                คณะศิลปกรรมศาสตร์ 
                | สาขาวิชาการออกแบบนิเทศศิลป์"
          sub="กิจกรรมออกแบบโปสเตอร์ ​ด้วยโปรแกรม Adobe Illustrator และได้รับการสนับสนุน Printer สำหรับคัดเลือกงานพิมพ์ จาก บริษัท แคนนอน มาร์เก็ตติ้ง (ไทยแลนด์) จำกัด​ ให้น้องๆ ได้ฝึกทดลองออกแบบจริง เข้าใจเรื่อง Shape & Form การจัด layout การวางภาพที่เป็นพื้นฐานทางการออกแบบ"
        />
        <CardContent
          main="การค้นหาตัวตนจากการแสดง : “Acting for Self- discovery Workshop”
          คณะนิเทศศาสตร์ | สาขาวิชาศิลปะการแสดง"
          sub="เปิดห้องเรียนการแสดงพาน้อง ๆ ได้ลองค้นหาความเป็นตัวตน ลองเข้าใจตัวเอง เข้าใจในความรู้สึกของมนุษย์ เรียนรู้เพื่อเข้าใจพื้นฐานเรื่องอารมณ์ในจิตใจ วิเคราะห์การแสดงออกของอารมณ์ ซึ่งเป็นหัวใจสำคัญของการแสดง "
        />
        <CardContent
          main="การจัดแสงและฉากภาพยนตร์ ด้วย Unreal Engine
                คณะดิจิทัลมีเดียและศิลปะภาพยนตร์ | สาขาวิชาสื่อดิจิทัล"
          sub="มาลองสร้างของจริงด้วยโปรแกรม Unreal ใน Workshop การสร้างฉากในแอนิเมชันหรือภาพยนตร์ พาทุกคนเรียนรู้การจัดแสง และการวางองค์ประกอบในการสร้างภาพยนตร์แอนิเมชัน Lighting and Compositing ช่วยให้น้องๆ ได้มีพื้นฐานความรู้ เพื่อสามารถต่อยอดพัฒนาความชอบในอนาคตได้"
        />
      </TimelineCard>
      <CardLine />
      <TimelineCard time="31 AUG 2024">
        <CardContent
          main="Marketing in Bangkok University: MARKETING SOUND CHECK"
          sub="ใครที่ชอบฟัง ASMR ทุกวันทุกคืน ต้องมาดูกิจกรรมนี้ ว่าด้วยเรื่องการตลาดกับการใช้เสียงสื่ออารมณ์​ กิจกรรม ASMR สุดพิเศษ​ ชม Showcase ของนักศึกษาปัจจุบัน ในโครงการ Strategic Partner"
        />
        <CardContent
          main="การสร้างภาพจำลองโดยเทคนิคด้าน Visual Effects (How to do liquid stimulation with VFX techniques )"
          sub="Workshop ที่จะให้ได้เรียนรู้​การจำลอง/สร้างของเหลวเสมือนจริง liquid stimulation ว่าทำอย่างไร และนำไปต่อยอดได้อีกหลายอย่าง ลองเรียน ลองรู้ ลองทำ เพื่อนำไปใช้ได้จริง"
        />
        <CardContent
          main="สาธิตการผลิตรายการ “วาไรตี้ผีบอก” (Workshop)
                คณะนิเทศศาสตร์ | สาขาวิชาวิทยุกระจายเสียง วิทยุโทรทัศน์ และการผลิตสื่อสตรีมมิ่ง"
          sub="แฟนคลับรายการผีๆ  ต้องมาลอง Workshop นี้ สาธิตการผลิตรายการประเภทวาไรตี้  และได้ทดลองฝึกปฏิบัติในทักษะการผลิตรายการที่ตนเองสนใจ"
        />

        <CardContent
          main="สาธิตการผลิตรายการ “วาไรตี้ผีบอก” (Workshop)
                คณะนิเทศศาสตร์ | สาขาวิชาวิทยุกระจายเสียง วิทยุโทรทัศน์ และการผลิตสื่อสตรีมมิ่ง"
          sub="แฟนคลับรายการผีๆ  ต้องมาลอง Workshop นี้ สาธิตการผลิตรายการประเภทวาไรตี้  และได้ทดลองฝึกปฏิบัติในทักษะการผลิตรายการที่ตนเองสนใจ"
        />
      </TimelineCard>
    </div>
  );
};

export default Timeline;
